Revit 2027 API
TextNoteOptions(ElementId) Constructor
 Constructs text options to create text of the given type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextNoteOptions(
	ElementId typeId
)
Public Sub New (
	typeId As ElementId
)
public:
TextNoteOptions(
	ElementId^ typeId
)
new :
        typeId : ElementId -> TextNoteOptions
Parameters
typeId ElementId
 Id of a text type that defines the style of a text note.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Except for the TypeId, all other properties of the option class will be populated with their respective default values.
See Also
Reference
TextNoteOptions Class
TextNoteOptions Overload
Autodesk.Revit.DB Namespace